<html>
  <body>
    <h1>Tablatures Manager</h1>
    <h3>Pourquoi?</h3>
    <p><b>Tablatures Manager</b> se veut un petit logiciel pratique. 
      Son utilit&eacute; r&eacute;side dans la simplification et la souplesse de la gestion
      de vos fichiers de tablatures.</p>
    <h3>Comment?</h3>
    <p><b>Tablatures Manager</b> liste un r&eacute;pertoire de votre choix
      et y recherche tous les fichiers dits "Guitar pro", 
      ensuite il vous proprose une gestion plus efficace que l'utilisation de r&eacute;pertoire
      et sous r&eacute;pertoire pour classer vos fichiers.</p>
    <h3>Utilisation</h3>
    <p>Lorsque vous d&eacute;marrerez <b>Tablatures Manager</b> pour la premi&eacute;re fois,
      l'application vous demandera quel r&eacute;pertoire elle doit lister &agrave;
      la recherche de vos fichiers dits "Guitar pro".
      Ensuite vous tomberez sur la fen&ecirc;tre principale de l'application,
      que vous rencontrerez syst&eacute;matiquement aux d&eacute;marrages suivants de l'application.
      Cette fen&ecirc;tre est la fen&ecirc;tre de recherche. Elle permet d'appliquer un seul et unique
      filtre à la recherche d'un fichier <b>GP</b>. Et pour ceci elle s'aide des informations que 
      l'utilisateur &agrave; d&eacute;j&agrave; renseign&eacute;. Aisni, par exemple, 
      si vous s&eacute;lectionnez un auteur particuli&eacute; dans la liste d&eacute;roulante titr&eacute;e
      <b>Auteur</b>, seuls les fichiers dont l'auteur &agrave; &eacute;t&eacute; renseign&eacute;
      et qui correspondent &agrave; l'auteur recherch&eacute; seront pr&eacute;sent dans la liste
      d&eacute;roulabte de fichiers.</p>
    <h4>Les menus et les diff&eacute;rents boutons</h4>
    <ul>
      <li>Le bouton <b>Valider</b> permet de lancer le fichier <b>GP</b> dans les fen&ecirc;tre 
        de recherche et d'affichage. Et de valider la modification dans la fen&ecirc;tre de modification.
      </li>
      <li>Les boutons <b>Annuler</b> et <b>Quitter</b> permetent dans le premier cas de quitter 
        la fen&ecirc;tre en cours et dans le second cas de fermer l'application.
      </li>
      <li>Le choix <b>Modifier</b> dans le premier menu permet de modifier la fiche du fichier <b>GP</b>
        actuel s&eacute;lectionn&eacute; dans la liste d&eacute;roulante des fichiers.
      </li>
      <li>Le choix<b>Afficher </b> dans le premier menu permet d'afficher la fiche du fichier <b>GP</b>
        actuel s&eacute;lectionn&eacute; dans la liste d&eacute;roulante des fichiers.</li>
      <li>Le choix <b>Voir le xml</b> lance l'affichage du fichier qui permet la sauvegarde des 
        donn&eacute;es avec le navigateur par d&eacute;faut.
      </li>
      <li>Le choix <b>Aide</b> permet l'affichage de cette m&ecirc; fen&ecirc;tre avec le navigateur par
        d&eacute;faut.
      </li>
      <li><b>Mettre &agrave; jour le xml</b> permet la mise à jour du fichier de donn&eacute;es xml
        sans red&eacute;marrage de l'application.
      </li>
      <li><b>Remise &agrave; z&eacute;ro de la recherche</b> permet de remettre &agrave; z&eacute;ro 
        toutes les listes d&eacute;roulante de la fen&ecirc;tre de recherche.
      </li>
    </ul>
    <h3>Comment ajouter de nouveaux fichiers ou en supprimer?</h3>
    <p>Ne vous en faite pas pour &ccedil;a, &agrave; chaque d&eacute;marrage de l'application 
      la diff&eacute;rence entre les fichiers pr&eacute;sent dans le r&eacute;pertoire renseign&eacute;, 
      et ses sous-r&eacute;pertoire, puis les chemins des fichiers sauvegard&eacute;s 
      comme tels dans le fichier xml de donn&eacute; g&eacute;n&egrave;re une action de l'application,
      qui selon le cas ajoute ou supprime dans le fichier de donn&eacute;es xml, le chemin du fichier
      correspondant.
    </p>Si vous &ecirc;tes en pleine utilisation de l'application, pour ne pas &agrave; red&eacute;marrer
      l'application une option dans le menu vous permez de produire cette action de recherche de 
      diff&eacute;rence et de modification du fichier de donn&eacute; en cons&eacute;quence.
    </p>
    <h3>J'ai un probl&egrave;me avec <b>Tablatures Manager</b></h3>
    <p>Nous vous suggerons tout d'abord de red&eacute;marrer l'application.
      Sinon red&eacute;marrez votre poste. 
      Et Si les probl&egrave;mes persistent veuillez me contacter.</p>
    <h3>&Agrave; propos</h3>
    <p><b>Tablatures Manager</b> par Keith Yves.</p>
    <p>yves.keith@wanadoo.fr</p>
    <p>2007 - 2008</p>
  </body>
</html>
